# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import pandas as pd
import sqlite3

In [2]:
curr = sqlite3.connect('data.sqlite')
c = curr.cursor()

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

In [12]:
df = pd.DataFrame(
    c.execute("""

select customerNumber, orderDate
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141      2003-01-31           Diego

In [13]:
df = pd.DataFrame(
    c.execute("""

SELECT customerNumber,
       contactLastName,
       contactFirstName
FROM customers
WHERE customerNumber in
    (
       SELECT customerNumber
       FROM orders 
       where orderDate = '2003-01-31'
)
;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

In [ ]:
df = pd.DataFrame(
    c.execute("""

SELECT productName,
       contactLastName,
       contactFirstName
FROM customers

WHERE productCode in
;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [15]:
#Your code here
df = pd.DataFrame(
    c.execute("""

SELECT employeeNumber, firstName, lastName
FROM employees as e
JOIN customers as c

;

""").fetchall()
)
df.columns = [x[0] for x in c.description]
df

     employeeNumber firstName lastName
0              1002     Diane   Murphy
1              1002     Diane   Murphy
2              1002     Diane   Murphy
3              1002     Diane   Murphy
4              1002     Diane   Murphy
5              1002     Diane   Murphy
6              1002     Diane   Murphy
7              1002     Diane   Murphy
8              1002     Diane   Murphy
9              1002     Diane   Murphy
10             1002     Diane   Murphy
11             1002     Diane   Murphy
12             1002     Diane   Murphy
13             1002     Diane   Murphy
14             1002     Diane   Murphy
15             1002     Diane   Murphy
16             1002     Diane   Murphy
17             1002     Diane   Murphy
18             1002     Diane   Murphy
19             1002     Diane   Murphy
20             1002     Diane   Murphy
21             1002     Diane   Murphy
22             1002     Diane   Murphy
23             1002     Diane   Murphy
24             1002     Diane   Murphy
25             1002     Diane   Murphy
26             1002     Diane   Murphy
27             1002     Diane   Murphy
28             1002     Diane   Murphy
29             1002     Diane   Murphy
...             ...       ...      ...
2776           1702    Martin   Gerard
2777           1702    Martin   Gerard
2778           1702    Martin   Gerard
2779           1702    Martin   Gerard
2780           1702    Martin   Gerard
2781           1702    Martin   Gerard
2782           1702    Martin   Gerard
2783           1702    Martin   Gerard
2784           1702    Martin   Gerard
2785           1702    Martin   Gerard
2786           1702    Martin   Gerard
2787           1702    Martin   Gerard
2788           1702    Martin   Gerard
2789           1702    Martin   Gerard
2790           1702    Martin   Gerard
2791           1702    Martin   Gerard
2792           1702    Martin   Gerard
2793           1702    Martin   Gerard
2794           1702    Martin   Gerard
2795           1702    Martin   Gerard
2796           1702    Martin   Gerard
2797           1702    Martin   Gerard
2798           1702    Martin   Gerard
2799           1702    Martin   Gerard
2800           1702    Martin   Gerard
2801           1702    Martin   Gerard
2802           1702    Martin   Gerard
2803           1702    Martin   Gerard
2804           1702    Martin   Gerard
2805           1702    Martin   Gerard

[2806 rows x 3 columns]

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!